dssoftx/BambuSphere/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304
# Move WiFi/LWIP buffers to PSRAM to free internal DMA-capable RAM for display SPI
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# CONFIG_MBEDTLS_HARDWARE_AES is not set
# Keep TLS crypto away from DMA-heavy internal-memory paths while LCD refresh
# owns large PSRAM-backed SPI transfers.
# CONFIG_MBEDTLS_HARDWARE_SHA is not set
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
# CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC is not set
# CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE is not set
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
# mbedtls debug tracing was on (level 1) even though esp_log_level_set()
# already suppresses the "mbedtls" tag at runtime in application.cpp — that
# runtime suppression wasn't actually silencing it (observed live: every TLS
# record on every connection was logging ssl_msg.c traces over UART). With
# every configured printer's local MQTT + cloud MQTT now TLS connections
# running concurrently (PrinterClientPool), this scaled with printer count.
# Disabling it at compile time removes the cost entirely, not just the
# runtime print.
# CONFIG_MBEDTLS_DEBUG is not set
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL is not set
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
# WPA2/WPA3 transition networks and mesh-assisted roaming.  The station keeps
# BSSID/channel selection open so 802.11k neighbor reports and 802.11v BSS
# transition requests can move it between router and repeater.
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
CONFIG_ESP_WIFI_ENABLE_SAE_H2E=y
CONFIG_ESP_WIFI_11KV_SUPPORT=y
CONFIG_ESP_WIFI_RRM_SUPPORT=y
CONFIG_ESP_WIFI_WNM_SUPPORT=y
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LV_OS_FREERTOS=y
CONFIG_ESP_LVGL_ADAPTER_ENABLE_DECODER=y
# LVGL's own worker thread stack is a few KB that would otherwise sit in
# internal SRAM for the life of the app; PSRAM is plentiful (8 MB) and this
# stack isn't latency-sensitive enough to need internal-only access.
CONFIG_ESP_LVGL_ADAPTER_LVGL_THREAD_STACK_IN_PSRAM=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_CACHE_DEF_SIZE=1048576
CONFIG_LV_IMAGE_HEADER_CACHE_DEF_CNT=32
CONFIG_ESP_LVGL_ADAPTER_PARTIAL_AUX_IMG_CACHE=y
# 60Hz (16ms) is unnecessary for a status/monitoring HMI and taxes the CPU on
# every redraw; 30Hz (33ms) halves that cost with no meaningful perceived
# difference for this UI (status text, arcs, camera preview - not fast
# animation/gaming content).
CONFIG_LV_DEF_REFR_PERIOD=33
CONFIG_LV_OBJ_STYLE_CACHE=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LWIP_MAX_SOCKETS=16
# IDF 5.5 FatFS enables exFAT in ffconf.h; exFAT requires long filename support.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
# Keep a single in-flight LCD transaction; IDF6 direct PSRAM DMA is sensitive
# to bus pressure while TLS/HTTP/camera work is active.
CONFIG_BSP_LCD_TRANS_QUEUE_DEPTH=1
CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
